000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВходящиеЗвонкиАстерикс/ВходящиеЗвонкиАстерикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВходящиеЗвонкиАстерикс</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>НомерОператора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникКоллЦентра</name>
    <type>
      <types>CatalogRef.СотрудникиКоллЦентра</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыБонусов/ТипыБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБонусов</name>
  <enumValues>
    <name>Органический</name>
  </enumValues>
  <enumValues>
    <name>Акционный</name>
  </enumValues>
  <enumValues>
    <name>Привлечение</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Корзина</name>
      <description>КОРЗИНА</description>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
    </items>
  </predefined>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>(Регл) Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>LNK. Может выступать в роли покупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>LNK. Может выступать в роли поставщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрямуюЗакупку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормаСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркетинговыеГруппы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.МаркетинговыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <comment>Магазин, где была проведена выдача карты</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <comment>(Служ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonForms/ФормаВходящегоЗвонкаКлиента/Module.bsl
&НаСервере
Процедура ЗаписатьОбновитьНаСервере()
	
	//Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда    
		
		ДанныеКонтрагента = Новый Структура;
		
		ДанныеКонтрагента.Вставить("Фамилия",	Фамилия);
		ДанныеКонтрагента.Вставить("Имя"	,	Имя);
		ДанныеКонтрагента.Вставить("Отчество",	Отчество);
		
		ДанныеКонтрагента.Вставить("Контрагент",	Контрагент);
		
		ДанныеКонтрагента.Вставить("НомерТелефона", Телефон); 
		
		ДанныеКонтрагента.Вставить("Электропочта", EMail);  
		
		ДанныеКонтрагента.Вставить("Пол", Пол);
		
		ДанныеКонтрагента.Вставить("РасширенныеДанные", Истина);
		
		ДанныеКонтрагента.Вставить("ДатаРождения", ДатаРождения); 
		
		ДанныеКонтрагента.Вставить("Электропочта", EMail);
		
		ДанныеКонтрагента.Вставить("Дети", Дети.Выгрузить());
		
		ДанныеКонтрагента.Вставить("ИнформационнаяКарта", "");  
		
		ДанныеКонтрагента.Вставить("Комментарий", Комментарий);  
		
		Если ВерификацияКлиентовСервер.ЗаписатьВерифицированныеДанныеКонтрагента(ДанныеКонтрагента).Выполнено Тогда
			
			Если СтрДлина(Телефон) = 10 Тогда 
				НомерТелефона = "38" + Телефон;         
			Иначе 
				НомерТелефона = СтрЗаменить(Телефон, "+", "");         
			КонецЕсли;	
			
			Запись = РегистрыСведений.ВходящиеЗвонкиАстерикс.СоздатьМенеджерЗаписи();
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|ГДЕ
			|	КонтрагентыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
			|	И КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
			|
			|СГРУППИРОВАТЬ ПО
			|	КонтрагентыКонтактнаяИнформация.Ссылка";
			Запрос.Параметры.Вставить("НомерТелефона", НомерТелефона);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда 
				Контрагент = Результат.Ссылка;
			Иначе 
				Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;	   
			
		КонецЕсли;
		
		ПриОткрытииНаСервере();
		
		//КонтрагентОбъект = Контрагент.ПолучитьОбъект();  
		//
		//КонтрагентОбъект.Наименование	= СокрЛП(ИмяПокупателя); 
		//
		//КонтрагентОбъект.ДатаРождения	= ДатаРождения;
		//КонтрагентОбъект.Пол			= Пол;   
		//КонтрагентОбъект.Покупатель		= Истина;
		//КонтрагентОбъект.ЮрФизЛицо		= Перечисления.ЮрФизЛицо.ФизЛицо;
		//
		//КонтрагентОбъект.Комментарий	= Комментарий;
		//
		//КонтрагентОбъект.Дети.Очистить();
		//КонтрагентОбъект.Дети.Загрузить(Дети.Выгрузить());
		//		
		//КонтрагентОбъект.Записать();
		//
		//Контрагент = КонтрагентОбъект.Ссылка;
		
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбновить(Команда)
	
	Если Сотрудник Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗаписатьОбновитьНаСервере(); 
	
	ПриОткрытии(Ложь);  
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТелефонНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТелефон(Команда)
	ДобавитьТелефонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		Если ТипЗнч(Параметры.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Контрагент 	= Параметры.Объект;
			ЗаполнитьФормуНаСервере(Контрагент); 
		ИначеЕсли ТипЗнч(Параметры.Объект) = Тип("Строка") Тогда //Контрагент отсутствует в БД. Имеем только номер телефона
			Телефон		= Параметры.Объект;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(Контрагент) Экспорт 
	
	//Заполнение карточки
	ИмяПокупателя 	= Контрагент.Наименование; 
	ДатаРождения	= Контрагент.ДатаРождения;
	Пол				= Контрагент.Пол;
	ДатаСоздания	= Контрагент.ДатаСоздания; 
	Документ		= Контрагент.ДокументУдостоверяющийЛичность; 
	Сотрудник		= Контрагент.ФизЛицо.Сотрудник;
	
	СтрокиТелефон 			= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
	СтрокиЭлектроннаяПочта 	= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты")));
	СтрокиАдрес 			= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес")));
	
	Если НЕ СтрокиТелефон.Количество() = 0 Тогда 
		Телефон = СтрокиТелефон[0].Представление;	
	КонецЕсли;
	
	Если НЕ СтрокиЭлектроннаяПочта.Количество() = 0 Тогда 
		EMail = СтрокиЭлектроннаяПочта[0].Представление;	
	КонецЕсли;
	
	Если НЕ СтрокиАдрес.Количество() = 0 Тогда 
		ФактическийАдрес = СтрокиАдрес[0].Представление;	
	КонецЕсли; 
	
	Дети.Загрузить(Контрагент.Дети.Выгрузить()); 
	
	Комментарий = СокрЛП(Контрагент.Комментарий); 
	
	ОбновитьСостояниеБонусногоСчетаНаСервере();  
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", ПредопределенноеЗначение("Перечисление.СостоянияЗаказовПокупателей.Закрыт"));
	
	ЗвонкиКлиента.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	
	Элементы.СписокЗаказов.Обновить();
	Элементы.СписокЗапросаДоступности.Обновить();
	Элементы.КомментарийКЗаказу.Обновить(); 
	
	ЗаполнитьФИО();
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСостояниеБонусногоСчетаНаСервере()
	
	
	ПараметрыЗапроса = Новый Структура(
	"ТипыБонусов, ТолькоТекущийОстаток, Команда"
	, ОбщегоНазначенияКлиентСервер.AAD(Перечисления.ТипыБонусов.Привлечение, Перечисления.ТипыБонусов.Органический, Перечисления.ТипыБонусов.Акционный)
	, Истина
	, "ОбщееСостояниеСчёта"
	);
	
	ДанныеОтвета = БонусныеБаллыСервер.BPS_ПолучитьОстатокБонусныхБаллов(Контрагент, ПараметрыЗапроса);
	
	Если ДанныеОтвета.Ошибка = Истина ИЛИ НЕ ДанныеОтвета.Свойство("ДанныеСчёта") Тогда
		
		ББ_ПериодРасчета = '00010101';
		
		СуммаБонусныхБаллов 					= 0;
		СуммаБонусныхБалловВРезерве 			= 0;
		СуммаБонусныхБалловАкционных 			= 0;
		СуммаБонусныхБалловВРезервеАкционных 	= 0;
		
		ББ_ПоследовательностьВПорядке	= Ложь;
		ББ_СостояниеПоследовательности	= ?(ДанныеОтвета.Ошибка = Истина
		, ДанныеОтвета.ОписаниеОшибки
		, "в ответе сервера нет информации о состоянии бонусного счёта ([ДанныеСчёта])"
		);
		
	Иначе
		
		ББ_ПериодРасчета = ДанныеОтвета.ДанныеСчёта.Период;
		
		СуммаБонусныхБаллов 					= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБаллов;
		СуммаБонусныхБалловВРезерве 			= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловВРезерве;
		СуммаБонусныхБалловАкционных 			= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловАкционных;
		СуммаБонусныхБалловВРезервеАкционных 	= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловВРезервеАкционных;
		
		ББ_ПоследовательностьВПорядке = (ДанныеОтвета.ДанныеСчёта.Регистратор_П = ДанныеОтвета.ДанныеСчёта.Регистратор_ГП);
		
		Если ББ_ПоследовательностьВПорядке Тогда
			
			ББ_СостояниеПоследовательности = "Последовательность списания бонусных баллов восстановлена!";
			
		Иначе	ББ_СостояниеПоследовательности = "Проблема! Последовательность списания бонусных баллов нарушена и не восстановлена!";
			
		КонецЕсли;
		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ДетиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.УникальныйИдентификатор) Тогда 
		Элемент.ТекущиеДанные.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВедомостьБонусныхНакоплений(Команда) 
	
	ОткрытьОтчёт("ВедомостьБонусныхНакоплений", "ВедомостьБонусныхНакопленийДокументНачисления", Контрагент);
	
КонецПроцедуры     

&НаКлиенте	
Процедура ОткрытьОтчёт(ИмяОтчёта, КлючВарианта, ТекущиеДанные)

	Если НЕ ТекущиеДанные = Неопределено Тогда

		Отбор = Новый Структура("Контрагент", ТекущиеДанные);

		ПараметрыНастроек = Новый Структура(
			"Период"
			, Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод)
		);
		ПараметрыНастроек.Период.ДатаОкончания = КонецДня(ТекущаяДата());

		ПараметрыФормы = Новый Структура(
			"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
			, КлючВарианта
			, Отбор
			, Истина
			, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки(ИмяОтчёта, ПараметрыНастроек)
		);

		ОткрытьФорму("Отчет." + ИмяОтчёта + ".Форма"
			, ПараметрыФормы
			, ЭтотОбъект
			, ЭтотОбъект
		);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДисконтныеКарты(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ВладелецКарты", Контрагент); 
	ПараметрыФормы.Вставить("ТолькоДисконтныеКарты", Истина);		
	ОткрытьФорму("Справочник.ИнформационныеКарты.ФормаСписка", 
		ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда 
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", ""); 
		//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", "");
	Иначе
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
		//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", ПредопределенноеЗначение("Перечисление.СостоянияЗаказовПокупателей.Закрыт"));
	КонецЕсли;  
	
	УстановитьВидимость();
	
	УстановитьДоступность();
	
	ПриОткрытииНаСервере();  
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступность() 
	
	//Элементы.ИмяПокупателя.Видимость = Не ЗначениеЗаполнено(Контрагент);
	
	Если Сотрудник Тогда 
		
		Элементы.Контрагент.Доступность 	= Ложь; 
		Элементы.Фамилия.Доступность		= Ложь;
		Элементы.Имя.Доступность			= Ложь;
		Элементы.Отчество.Доступность		= Ложь;
		Элементы.ДатаРождения.Доступность	= Ложь;
		Элементы.Пол.Доступность			= Ложь;
		//Элементы.Телефон.Доступность		= Ложь;
		Элементы.EMail.Доступность			= Ложь;
		Элементы.ФактическийАдрес.Доступность = Ложь;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ЕстьДеньРожденияРебенка(Контрагент) 

	Возврат Справочники.Контрагенты.ЕстьДеньРожденияРебенка(Контрагент);	
	
КонецФункции	

&НаКлиенте
Процедура УстановитьВидимость() 
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		Элементы.Контрагент.Видимость 	= Истина;
		Элементы.Фамилия.Видимость		= Истина;   
		Элементы.Имя.Видимость			= Истина;
		Элементы.Отчество.Видимость		= Истина;
		
		Элементы.ГруппаЗаказы.Видимость = Истина;    
		
		Элементы.ДеньРожденияРебенка.Видимость = ЕстьДеньРожденияРебенка(Контрагент);
	Иначе 
		Элементы.Контрагент.Видимость 	= Истина;
		Элементы.Фамилия.Видимость		= Истина;   
		Элементы.Имя.Видимость			= Истина;
		Элементы.Отчество.Видимость		= Истина;
		
		Элементы.ГруппаЗаказы.Видимость = Ложь;
	КонецЕсли; 
		
КонецПроцедуры	

&НаКлиенте
Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокЗаказов.ТекущиеДанные = Неопределено Тогда 
		СписокЗапросаДоступности.Параметры.УстановитьЗначениеПараметра("ДокументОснование", "");
		КомментарийКЗаказу.Параметры.УстановитьЗначениеПараметра("ЗаказПокупателя", "");
	Иначе
		СписокЗапросаДоступности.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Элементы.СписокЗаказов.ТекущаяСтрока);
		КомментарийКЗаказу.Параметры.УстановитьЗначениеПараметра("ЗаказПокупателя", Элементы.СписокЗаказов.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьФормуНаСервере(Контрагент);
		
	УстановитьВидимость();
	
КонецПроцедуры

Процедура ЗаполнитьФИО()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Фамилия КАК Фамилия,
	|	ТаблицаРегистра.Имя КАК Имя,
	|	ТаблицаРегистра.Отчество КАК Отчество
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо ССЫЛКА Справочник.Контрагенты) КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ФизЛицо = &ФизЛицо"
	);
	Запрос.УстановитьПараметр("ФизЛицо", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Фамилия  = Выборка.Фамилия;
		Имя      = Выборка.Имя;
		Отчество = Выборка.Отчество;
		
	Иначе
		
		СоставНаименования = ОбщегоНазначенияКлиентСервер.lx_FillValueList(, СокрЛП(Контрагент.Наименование),, " ", 3,, Новый ОписаниеТипов("Строка"));
		
		Фамилия  = СоставНаименования[0];
		Имя      = СоставНаименования[1];
		Отчество = СоставНаименования[2];
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Сообщить("Не выбран контрагент!");
		Возврат;
	КонецЕсли;	
	
	П = Новый Структура; 
	П.Вставить("Контрагент", Контрагент); 
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", П, ЭтотОбъект); 

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеКлиенту(Команда)
	
	Если Не ПустаяСтрока(Телефон) И Не Контрагент.Пустая() Тогда 

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НомерТелефона", Телефон);
		ПараметрыФормы.Вставить("Контрагент", Контрагент);
		//ПараметрыФормы.Вставить("ЗаказКлиента", Объект.Ссылка);

		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаОтправкиСообщения", ПараметрыФормы, ЭтаФорма); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТелефонИзменениеТекстаРедактированияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ТелефонИзменениеТекстаРедактированияНаСервере();
КонецПроцедуры
